2019-02-02-Org-mode-and-google-calendar-sync.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-08 Wed 16:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org mode and google calendar sync</title>
<meta name="author" content="Matúš Goljer" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="css/blog.css" />
</head>
<body>
<div id="preamble" class="status">

<div style="text-align: left; float: left;">
  <a href="./index.html">Home</a>
  <a href="https://github.com/Fuco1/">GitHub</a>
  <a href="https://www.patreon.com/user?u=3282358">Patreon</a>
</div>
<div style="text-align: right;">
  <a href="https://github.com/Fuco1/Fuco1.github.io/discussions">Discussions</a>
  <a href="https://fuco1.github.io/rss.xml">RSS</a>
  <a href="https://twitter.com/Fuco1337">Twitter</a>
</div>
<hr />
</div>
<div id="content" class="content">
<h1 class="title">Org mode and google calendar sync</h1>

<p>
As a contractor working for multiple clients I juggle many projects
and meetings all the time.  Fortunately for me, there is <a href="https://orgmode.org/">orgmode</a>.
Unfortunately, my clients have not yet learned to appreciate its
merits.  Fortunately though, they all use the GSuite platform from
Google, which means agendas are planned in Google Calendars.
</p>

<p>
So I finally bit the bullet and decided to integrate Google Calendar
into my org agenda.  I didn't have to go a long way before finding
<a href="https://github.com/kidd/org-gcal.el">org-gcal.el</a>.
</p>

<p>
My setup is taken mostly from <a href="https://cestlaz.github.io/posts/using-emacs-26-gcal/">Using Emacs - 26 - Google Calendar, Org
Agenda</a> by the amazing Mike Zamansky.  One difference from Mike's setup
is that I'm using a single-way sync only, that is I only fetch from
google calendar and do not publish anything.
</p>

<p>
The reason is that I use multiple calendars (I basically have a google
account at every company I work for plus a personal calendar) and the
workflow with events and inviting myself from one calendar to another
as attendees is too complex and fragile to trust some automated tool.
And I can not afford my calendars to break.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span><span style="color: #b4fa70;">use-package</span> <span style="color: #e6a8df;">org-gcal</span>
  <span style="color: #ad7fa8;">:after</span> org
  <span style="color: #ad7fa8;">:config</span>
  <span style="color: #888a85;">(</span><span style="color: #b4fa70;">setq</span> org-gcal-client-id <span style="color: #e9b96e;">"781554523097-ocjovnfpqgtpoc4qv7ubr8c679t96bv7.apps.googleusercontent.com"</span>
        org-gcal-client-secret <span style="color: #e9b96e;">"&lt;&lt;gcal-secret&gt;&gt;"</span>
        org-gcal-file-alist '<span style="color: #888a85;">((</span><span style="color: #e9b96e;">"matus.goljer@gmail.com"</span> . <span style="color: #e9b96e;">"~/org/gcal.org"</span><span style="color: #888a85;">))</span>
        org-gcal-header-alist '<span style="color: #888a85;">((</span><span style="color: #e9b96e;">"matus.goljer@gmail.com"</span> . <span style="color: #e9b96e;">"#+PROPERTY: TIMELINE_FACE \"pink\"\n"</span><span style="color: #888a85;">))</span>
        org-gcal-auto-archive nil
        org-gcal-notify-p nil<span style="color: #888a85;">)</span>

  <span style="color: #888a85;">(</span>add-hook <span style="color: #e6a8df;">'org-agenda-mode-hook</span> <span style="color: #e6a8df;">'org-gcal-fetch</span><span style="color: #888a85;">)</span>
  <span style="color: #888a85;">(</span>add-hook <span style="color: #e6a8df;">'org-capture-after-finalize-hook</span> <span style="color: #e6a8df;">'org-gcal-fetch</span><span style="color: #888a85;">))</span>
</pre>
</div>

<p>
I'm also using <a href="https://github.com/Fuco1/org-timeline">org-timeline</a> so I add some extra header arguments to
the generated file to add a different color to the Google Calendar
entries.
</p>
</div>
<div id="postamble" class="status">
<hr />
<div style="text-align: left; float: left;">Published at: 2019-02-02 13:54 Last updated at: 2023-02-08 16:00</div>
<div style="text-align: right;">Found a typo? <a href="https://github.com/Fuco1/fuco1.github.io/blob/master/posts/2019-02-02-Org-mode-and-google-calendar-sync.org">Edit on GitHub!</a></div>
</div>
</body>
</html>